//Напишите программу, которая на вход принимает число А и выдает сумму чисел от 1 до А



// Console.WriteLine("Введите число A: ");
// int A = Convert.ToInt32(Console.ReadLine());

// int sum = 0;

// for(int i = 1; i <= A; i++)
// {
//     sum = sum + i;
// }
// Console.WriteLine($"Сумма чисел от 1 до А = {sum}");

//Решение с помощью функции:    

int cycle (int A);
{
    int sum = 0;
    for(int i = 1; i <= A; i++)
    {
        sum = sum + i;
    }
}
Console.WriteLine("Введите число A: ");
int A = Convert.ToInt32(Console.ReadLine());
int sum = cycle a;
Console.WriteLine($"Сумма чисел от 1 до А = {sum}");
